In [1]:
import pandas as pd

In [2]:
data = {
    'id': [2, 1, 3, 4, 5, 6],
    'name': ['Vinay', 'Kushal', 'Aman', 'Arun', 'Akhil', 'Arya'],
    'age': [22, 25, 24, 25, 26, 27],
    'occ': ['engineer', 'doctor', 'accountant', 'accountant', 'accountant', 'accountant']
}

df = pd.DataFrame(data)
df

   id    name  age         occ
0   2   Vinay   22    engineer
1   1  Kushal   25      doctor
2   3    Aman   24  accountant
3   4    Arun   25  accountant
4   5   Akhil   26  accountant
5   6    Arya   27  accountant

In [3]:
Top_two = df.head(2)
Top_two

   id    name  age       occ
0   2   Vinay   22  engineer
1   1  Kushal   25    doctor